<script lang="ts">

export default {
}
</script>
<template>
  <header class="flex flex-col hscreenh justify-center items-center text-white">
    <h1 class="headers text-5xl">HeliCraft</h1>
    <h2 class="text-lg">Правила сервера</h2>
  </header>
  <main class="flex bg-violet-800 w-full text-white justify-center items-center text-lg">
        <ol>
          <li>
            <b>Раздел 1. Общие положения.</b>
            <ol>
                <li>Сервер предоставляет услуги по принципу "Как есть".</li>
                <li>Любой игрок можнет быть заблокирован на сервере в любой момент, без объяснения причин.</li>
                <li>На сервере могут происходить любые обновления, сбои, с последствиями вплоть до полного уничтожения прогресса данных игроков, и сервер не обязан возмещать/восстанавливать какие-либо ресурсы</li>
                <li>Наказание выдается исходя из оценки ситуации администрацией, правила являются лишь ориентиром для выдачи наказания. </li>
                <li>Правила могут быть изменены в любой момент, без уведомления от администрации. Если игрок не согласен с новыми правилами он обязан прекратить игру на сервере в соответсвии с п.п. 1.7. </li>
                <li>Все жалобы должны быть поданы и рассмотрены в соответствии с разделом правил 4</li>
                <li>Любой игрок, играющий на сервере полностью и безоговорочно согласен с правилами и действиями администрации
                    <ol>
                        <li>Незнание правил не освобождает от ответственности</li>
                    </ol>
                </li>
                <li>Ответственность за игровой аккаунт несет только сам игрок</li>
                <li>Все блокировки аккаунтов выдаются по IP-адресу. В случае, если один IP-адрес используется несколькими игроками, блокировка накладывается на всех игроков</li>
            </ol>
          </li>
        </ol>
  </main>
</template>
<style scoped>
main{
    padding-top: 20px !important; 
    padding-bottom: 20px !important;
}
.hscreenh {
  height: 95vh;
}
ol {
    counter-reset: item;
    padding-left: 0;
    margin-left: 20px;
  }

  li {
    margin: 5px 0;
    list-style-type: none;
  }

  li::before {
    counter-increment: item;
    content: counters(item, ".") ". ";
  }

</style>
