<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>HeliCraft: Правила</title>
    <link rel="stylesheet" href="/bootstrap/bootstrap.min.css">
    <link rel="stylesheet" href="/css/styles.css">
</head>
<body>
    <header>
        <?php include '/../api/navbar.php'; ?>
        <div class="container-fluid landing">
            <h1 class="text-center font2 text-white">HeliCraft</h1>
            <h2 class="text-center text-white">Правила сервера</h2>
            </div>
        </div>
    </header>
    <main>
        <div class="container-fluid">
             <div class="row">
                 <div class="row d-flex justify-content-center">
                     <div class="col-8 text-white"><hr class="border opacity-75 border-3"></div>
                     <div class="col-12">
                         <p class="text-white text-center">
                          <strong>Раздел 1. Общие положения.</strong> <br><br>



                              1.1. Сервер предоставляет услуги на бесплатной основе. Услуги предоставляются по принципу "Как есть"*.<br><br>



                              1.2. Любой игрок может быть заблокировн на сервере в любой момент, и сервер не обязан предоставлять причину этого действия.<br><br>



                              1.3. На сервере могут происходить любые обновления, сбои, с последствиями вплоть до полного уничтожения данных игроков, и сервер не обязан возмещать/восстанавливать какие-либо ресурсы.
                              <br><br>


                              1.4. Наказание выдается исходя из оценки ситуации администрацией, правила являются лишь ориентиром для выдачи наказания.
                              <br><br>


                              1.5. Правила могут быть изменены в любой момент, без уведомления от администрации. Если игрок не согласен с новыми правилами он обязан прекратить игру на сервере в соответсвии с п.п. 1.7.
                              <br><br>


                              1.6. Все жалобы и аппеляции подаются на странице поддержки(клик). Жалобы в других местах могут быть проигнорированы. Срок ответа на жалобу - до 48 часов. Если вам ответили позже/не ответили пишите в Telegram @ms0ur.
                              <br>


                                  1.6.1. Все жалобы на все действия администрации, игроков и т.д. подлежат рассмотрению только в течении 2х недель с момента произошедшего.
                                  <br>


                                  1.6.2. Все апелляции о блокировках подлежат рассмотрению только в течении месяца с момента выдачи наказания.
                                  <br>


                                  1.6.3. Если жалобу подает непричастный к событию игрок, то она не подлежит рассмотрению.
                                  <br><br>


                              1.7. Любой игрок, играя на сервере полностью и безоговорочно согласен с данными правилами.
                              <br>


                                  1.7.1. Незнание правил не освобождает от ответственности
                                  <br><br>


                              1.8. Ответственность за игровой аккаунт несет только сам игрок.
                              <br><br><br>


                              


                              <strong>
                              Раздел 2. Общие правила.
                                </strong>
                              <br><br>

                              2.1. Гриферство**, в любых его проявлениях запрещено - Наказание за нарушение: бан от 2х недель до перманентного

                              <br><br>

                              2.2. Использование модификаций, которые позваляют получить любое преимущиество над другими игроками запрещено - Наказание за нарушение: бан от 2х недель до перманентного

                              <br><br>

                              2.3. Обход любых блокировок любого типа запрещен - Наказание за нарушение: перманентный бан
                              <br><br>


                              2.4. Выдача себя за другого игрока запрещено - Наказание за нарушение: перманентный бан

                              <br><br>

                              2.5. Обход(или её попыткпа) системы доступа на сервер(авторизации) - Наказание за нарушение: перманентный бан

                              <br><br><br>

                              


                              <strong>
                              Раздел 3. Правила чата.
                              </strong>
                              <br><br>

                              3.1. Любые высказывания/разговоры на политические темы запрещены - Наказание за нарушение: мут от 30 дней до перманентного бана

                              <br><br>

                              3.2. Мат запрещен(в т.ч. завуалированный) - Наказание за нарушение: мут от 2х дней до перманентного бана

                              <br><br>

                              3.3. Любые разговоры/высказывания на темы 18+ запрещены - Наказание за нарушение: мут от 30 дней до перманентного бана


                              <br><br>
                              3.4. Расизм, нацизм и т.п. - Наказание за нарушение: перманентный бан

                              <br><br>

                              3.5. Реклама других серверов/ресурсов запрещена - Наказание за нарушение: мут от 2х дней до перманентного бана

                              <br><br>

                              3.6. Настраивание игроков против администрации, неадекватная критика действий администрации - Наказание за нарушение: мут от 2х дней до перманентного бана

                              <br><br>

                              3.7. Любые оскорбления, в адрес любых игроков/животных/людей(даже не связанных с проектом) -Наказание за нарушение: мут от 2х дней до перманентного бана


                              <br><br><br>
                              


                              <strong>
                              Раздел 4. Правила для админов.
                            </strong>
                              <br><br>

                              4.1. Разглашение любых данных об игроке запрещена - Наказание за нарушение: снятие с должности админа и перманентный бан
                              <br><br>


                              4.2. Выдача неразмеренного наказания запрещено – Наказание за нарушение: от предупреждения до снятия с должности админа

                              <br><br>

                              4.3. Злоупотребление правами админа запрещено - Наказание за нарушение: от предупреждения до снятия с должности админа

                              <br><br>

                              4.4. Нарушение любого правила из Разделов 2 и 3 - Наказание за нарушение: от предупреждения до снятия с должности админа + наказание из нарушенных пунктов
                         </p>
                     </div>
                     <div class="col-4 text-white"><hr class="border opacity-75 border-3"></div>
                 </div>
             </div>
        </div>
     </main>
     <footer>
         <?php
         include '/../api/footer.php';
         ?>
     </footer>
</body>
</html>